Долома/src/Documents/УЗД/УЗД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УЗД</name>
  <registerRecords>InformationRegister.ДатаПредполагамогоЗапуска</registerRecords>
  <registerRecords>InformationRegister.СостояниеЖивотных</registerRecords>
  <registerRecords>InformationRegister.Аборты</registerRecords>
  <registerRecords>InformationRegister.ДатаПредполагаемогоОтёла</registerRecords>
  <registerRecords>InformationRegister.ПроизводственныеГруппы</registerRecords>
  <registerRecords>InformationRegister.УЗИисследования</registerRecords>
  <registerRecords>InformationRegister.ВыбраковкаЖивотных</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециалистУЗИ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Животные</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерУЗИ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДеньУЗИ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПредполагаемогоОтёла</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗапуска</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПереводаВоВторойСухостой</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусЖивотного</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Долома/src/InformationRegisters/СостояниеЖивотных/СостояниеЖивотных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеЖивотных</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СостояниеЖивотного</name>
    <type>
      <types>EnumRef.СтатусЖивотного</types>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/УЗИисследования/УЗИисследования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УЗИисследования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Акушер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЖивотного</types>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>НомерУЗИ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеньУЗИ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Мать</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/ДатаПредполагаемогоОтёла/ДатаПредполагаемогоОтёла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатаПредполагаемогоОтёла</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаПредполагаемогоОтёла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/ДатаПредполагамогоЗапуска/ДатаПредполагамогоЗапуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатаПредполагамогоЗапуска</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПереводаВоВторойСухостой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/Аборты/Аборты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аборты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТипПрекращенияСтельности</name>
    <type>
      <types>EnumRef.ТипПрекращенияСтельности</types>
    </type>
  </resources>
  <resources>
    <name>Осеменатор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОткрытьЛактацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МежотёльныйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Мать</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/ВыбраковкаЖивотных/ВыбраковкаЖивотных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыбраковкаЖивотных</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Брак</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаВыбраковки</name>
    <comment>Причина выбраковки животного</comment>
    <type>
      <types>EnumRef.ПричиныВыбраковки</types>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/ПроизводственныеГруппы/ПроизводственныеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроизводственныеГруппы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроизводственнаяГруппа</name>
    <type>
      <types>EnumRef.ПроизводственныеГруппы</types>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/Осеменения/Осеменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Осеменения</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Осеменатор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Инъекция</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДоз</name>
    <comment>Использованное количество доз семени</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СхемаСинхронизации</name>
    <type>
      <types>CatalogRef.СхемыСинхронизации</types>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Семя</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйКлючЗаписи</name>
    <comment>Нужен для более чем одной строки не уникальной записи (документ ДобавлениеЖивотного)</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/Enums/СтатусЖивотного/СтатусЖивотного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЖивотного</name>
  <enumValues>
    <name>Стельная</name>
  </enumValues>
  <enumValues>
    <name>НеСтельная</name>
  </enumValues>
  <enumValues>
    <name>Осеменена</name>
  </enumValues>
</mdclass:Enum>

Долома/src/Documents/УЗД/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СостояниеЖивотных.Записывать 			= Истина;
	Движения.УЗИисследования.Записывать 			= Истина;
	Движения.ДатаПредполагаемогоОтёла.Записывать 	= Истина;
	Движения.ДатаПредполагамогоЗапуска.Записывать 	= Истина; 
	Движения.Аборты.Записывать 						= Истина;  
	Движения.ВыбраковкаЖивотных.Записывать			= Истина; 
	Движения.ПроизводственныеГруппы.Записывать		= Истина; 
	
	Для каждого СтрокаТабличнойЧасти Из Животные Цикл
		
		НовоеДвижение 							= Движения.СостояниеЖивотных.Добавить();
		НовоеДвижение.Период 					= Дата;
		НовоеДвижение.Животное 					= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.СостояниеЖивотного 		= СтрокаТабличнойЧасти.Статус;
		
		НовоеДвижение 							= Движения.УЗИИсследования.Добавить();
		НовоеДвижение.Период 					= Дата;
		НовоеДвижение.Мать		 				= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Акушер 					= СпециалистУЗИ;
		НовоеДвижение.Статус 					= СтрокаТабличнойЧасти.Статус;
		НовоеДвижение.Примечание 				= СтрокаТабличнойЧасти.Примечание;	
		НовоеДвижение.ДеньУЗИ 					= СтрокаТабличнойЧасти.ДеньУЗИ;
		НовоеДвижение.НомерУЗИ 					= СтрокаТабличнойЧасти.НомерУЗИ;	
		
		НовоеДвижение 							= Движения.ДатаПредполагаемогоОтёла.Добавить();
		НовоеДвижение.Период 					= Дата;
		НовоеДвижение.Животное 					= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.ДатаПредполагаемогоОтёла 	= СтрокаТабличнойЧасти.ДатаПредполагаемогоОтёла;
		
		НовоеДвижение 								= Движения.ДатаПредполагамогоЗапуска.Добавить();
		НовоеДвижение.Период 						= Дата;
		НовоеДвижение.Животное 						= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.ДатаЗапуска 					= СтрокаТабличнойЧасти.ДатаЗапуска;
		НовоеДвижение.ДатаПереводаВоВторойСухостой 	= СтрокаТабличнойЧасти.ДатаПереводаВоВторойСухостой; 
		
		Если СтрокаТабличнойЧасти.НомерУЗИ > 1 И СтрокаТабличнойЧасти.Статус = Перечисления.СтатусЖивотного.НеСтельная Тогда
			НовоеДвижение 								= Движения.Аборты.Добавить();
			НовоеДвижение.Период 						= Дата;
			НовоеДвижение.Мать							= СтрокаТабличнойЧасти.Животное;
			НовоеДвижение.ТипПрекращенияСтельности		= Перечисления.ТипПрекращенияСтельности.Аборт;
			НовоеДвижение.Осеменатор				 	= ПоследнийОсеменатор(СтрокаТабличнойЧасти.Животное); 
			
			Если Ферма.ВыбраковыватьЖивотныхПослеАборта Тогда
				НовоеДвижение 						= Движения.ВыбраковкаЖивотных.Добавить();
				НовоеДвижение.Животное 				= СтрокаТабличнойЧасти.Животное;
				НовоеДвижение.Период 				= Дата;
				НовоеДвижение.Брак					= Истина;
				НовоеДвижение.ПричинаВыбраковки     = Перечисления.ПричиныВыбраковки.Аборт; 
				
				НовоеДвижение 							= Движения.ПроизводственныеГруппы.Добавить();
				НовоеДвижение.Животное 					= СтрокаТабличнойЧасти.Животное;
				НовоеДвижение.Период 					= Дата;
				НовоеДвижение.ПроизводственнаяГруппа	= Перечисления.ПроизводственныеГруппы.Брак;  
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПоследнийОсеменатор(Животное)
	
	Осеменатор = Справочники.Сотрудники.ПустаяСсылка(); 
	ВыборкаПоследнегоОСеменения = Документы.Осеменение.ДанныеПоследнегоОсеменения(Дата,Животное);
	Если ВыборкаПоследнегоОСеменения <> Неопределено Тогда
		Осеменатор = ВыборкаПоследнегоОСеменения.Осеменатор; 
	КонецЕсли;
	Возврат Осеменатор;

КонецФункции // ПоследнийОсеменатор()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НеСтельныеЖивотные = ВыборкаНеСтельныхЖивотных();
	Если НеСтельныеЖивотные.Количество() > 0 Тогда  
		Пока НеСтельныеЖивотные.Следующий() Цикл   
			Если НеСтельныеЖивотные.СостояниеЖивотного = Перечисления.СтатусЖивотного.Осеменена Тогда
				ТекстОшибки = СтрШаблон("Строка %1: у животного %2 не прошло 28 дней после осеменения (%3 дней)!", 
				НеСтельныеЖивотные.НомерСтроки,НеСтельныеЖивотные.Животное, НеСтельныеЖивотные.ДнейПослеОсеменения) + Символы.ПС;
			Иначе
				ТекстОшибки = СтрШаблон("Строка %1: у животного %2 нет осеменения!", 
				НеСтельныеЖивотные.НомерСтроки,НеСтельныеЖивотные.Животное) + Символы.ПС;
			КонецЕсли;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ТекстОшибки; 
			Сообщение.Поле = "Животные["+Строка(НеСтельныеЖивотные.НомерСтроки-1)+"].Животное";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЦикла;
		Отказ = Истина; 	
	КонецЕсли;	
	
КонецПроцедуры  

Функция ВыборкаНеСтельныхЖивотных()
	
	ТЧЖивотные = Животные.Выгрузить(,"НомерСтроки, Животное");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧЖивотные.НомерСтроки КАК НомерСтроки,
	               |	ТЧЖивотные.Животное КАК Животное
	               |ПОМЕСТИТЬ втЖивотные
	               |ИЗ
	               |	&ТЧЖивотные КАК ТЧЖивотные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втЖивотные.НомерСтроки КАК НомерСтроки,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(втЖивотные.Животное) КАК Животное,
	               |	ВЫБОР
	               |		КОГДА ОсемененияСрезПоследних.Период ЕСТЬ NULL
	               |			ТОГДА СостояниеЖивотныхСрезПоследних.СостояниеЖивотного
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ОсемененияСрезПоследних.Период > СостояниеЖивотныхСрезПоследних.Период
	               |					ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусЖивотного.Осеменена)
	               |				ИНАЧЕ СостояниеЖивотныхСрезПоследних.СостояниеЖивотного
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СостояниеЖивотного,
	               |	РАЗНОСТЬДАТ(ЕСТЬNULL(ОсемененияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ДатаДокумента, ДЕНЬ) КАК ДнейПослеОсеменения
	               |ИЗ
	               |	втЖивотные КАК втЖивотные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеЖивотных.СрезПоследних(&МоментВремени, Регистратор <> &Ссылка) КАК СостояниеЖивотныхСрезПоследних
	               |		ПО втЖивотные.Животное = СостояниеЖивотныхСрезПоследних.Животное
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Осеменения.СрезПоследних(&МоментВремени, ) КАК ОсемененияСрезПоследних
	               |		ПО втЖивотные.Животное = ОсемененияСрезПоследних.Животное
	               |ГДЕ
	               |	(ВЫБОР
	               |				КОГДА ОсемененияСрезПоследних.Период ЕСТЬ NULL
	               |					ТОГДА СостояниеЖивотныхСрезПоследних.СостояниеЖивотного
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ОсемененияСрезПоследних.Период > СостояниеЖивотныхСрезПоследних.Период
	               |							ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусЖивотного.Осеменена)
	               |						ИНАЧЕ СостояниеЖивотныхСрезПоследних.СостояниеЖивотного
	               |					КОНЕЦ
	               |			КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.СтатусЖивотного.НеСтельная)
	               |			ИЛИ ВЫБОР
	               |					КОГДА ОсемененияСрезПоследних.Период ЕСТЬ NULL
	               |						ТОГДА СостояниеЖивотныхСрезПоследних.СостояниеЖивотного
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ОсемененияСрезПоследних.Период > СостояниеЖивотныхСрезПоследних.Период
	               |								ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусЖивотного.Осеменена)
	               |							ИНАЧЕ СостояниеЖивотныхСрезПоследних.СостояниеЖивотного
	               |						КОНЕЦ
	               |				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.СтатусЖивотного.Осеменена)
	               |				И РАЗНОСТЬДАТ(ЕСТЬNULL(ОсемененияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ДатаДокумента, ДЕНЬ) < 28)";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("МоментВремени",МоментВремени()); 
	Запрос.УстановитьПараметр("ДатаДокумента",Дата); 
	
	Запрос.УстановитьПараметр("ТЧЖивотные",ТЧЖивотные);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Возврат Выборка;

КонецФункции // ПроверкаНаСтельность()
